{"created_at":1547919357,"data":{"chapters":[{"title":"Obsah","rows":[{"type":"normal","components":[{"type":"paragraph","context":{"text":"Matematika (z řeckého μαθηματικός (mathematikós) = milující poznání; μάθημα (máthema) = věda, vědění, poznání) je věda zabývající se z formálního hlediska kvantitou, strukturou, prostorem a změnou. Matematika je též popisována jako disciplína, jež se zabývá vytvářením abstraktních entit a vyhledáváním zákonitých vztahů mezi nimi.\n\nMatematika je založena a budována jako exaktní věda. Její exaktnost (podobně jako jiných exaktních věd) tkví v tom že, jak matematické objekty, tak i operace nad nimi jsou exaktně vytyčeny (tj. s nulovou vnitřní vágností) [1], tedy tak, že každý v matematice (v dané exaktní vědě) vzdělaný člověk naprosto přesně (bez jakýchkoli pochyb) ví, co znamenají. To je podstata exaktnosti této disciplíny. V rámci matematiky existuje ale ještě jinak chápaná exaktnost, a to exaktnost použitých metod a jejich výsledků:\n\nPříkladem může být exaktní a neexaktní řešení: Některé aplikace jsou řešitelné pouze opuštěním přísného a omezujícího požadavku exaktnosti výsledku. Například proto, že neexistuje matematická funkce, která by byla (exaktním) řešením dané diferenciální rovnice. Může ale existovat posloupnost funkcí, která s libovolnou přesností (nikoli však exaktně), řešením té rovnice je. Dosazením exaktního výsledku (řešení) do výchozího vztahu (rovnice) dostáváme identitu. Neexaktní výsledek se od exaktního liší o „chybu “, takže po jeho dosazení identitu nedostaneme.\n\nCharakteristickou vlastností matematiky je její důraz na absolutní přesnost metod a nezpochybnitelnost výsledků. Tyto vlastnosti, které matematiku odlišují od všech ostatních vědních disciplín, mají původ již v antickém Řecku. Nejstarším dochovaným příkladem tohoto přístupu je kniha řeckého matematika Euklida Základy pocházející z 4. století př. n. l.\n\nŠiroké veřejnosti je známa tzv. elementární matematika, která se zabývá operováním s čísly, řešením praktických úloh, jednoduchých rovnic a popisem základních geometrických objektů. Ve fyzice, informatice, chemii, ekonomii a dalších oborech se často využívají výsledky aplikované matematiky, která je také těmito obory zpětně ovlivňována. Tzv. čistá matematika se zabývá pouze vysoce abstraktními pojmy, jejichž definování není přímo motivováno praktickým užitkem v reálném světě. Některé obory čisté matematiky se nacházejí na pomezí s logikou či filozofií."}},{"type":"img","context":{"src":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/68\/Mathematicsgeneral.jpg","desc":"Ukázka mat. oblastí"}}]}]}]}}